#!/usr/bin/env bash

# $BASH_SOURCE 为当前脚本的绝对路径
# dirname 获取当前的路径
# 脚本执行 cd 后，后续命令在该目录下执行，即生成文件或创建文件夹，都是基于 cd 后的目录，但是脚本执行后，CLI 中的路径还是原始路径
cd "$(dirname $BASH_SOURCE)"

next=0

if ! [ -x "$(command -v jq)" ]; then
  echo -e "\033[0m\033[31m请先安装 jq \033[37m"
  ((next++))
fi

if ! [ -x "$(command -v gawk)" ]; then
  echo -e "\033[0m\033[31m请先安装 gawk \033[37m"
  ((next++))
fi

if [ 0 -eq $next ]; then
  if [ -f ./"$1"/get_versions.sh ]; then
    source ./"$1"/get_versions.sh
  else
    echo -e "\033[7m\033[31m文件不存在，啥也不生成，停止执行\033[37m"
  fi
fi

########################
#echo -e "\033[0m\033[7m\033[32m生成完成\033[37m"
########################

# echo -e "\033[字背景颜色；文字颜色m字符串\033[0m"
# 背景色：40 - 黑，41 - 红，42 - 绿，43 - 黄，44 - 蓝，45 - 紫，46 - 天蓝，47 - 白
# 字颜色：30 - 黑，31 - 红，32 - 绿，33 - 黄，34 - 紫，35 - 粉，36 - 天蓝，37 - 白
# 控制选项说明：
#    \033[0m             - 关闭所有属性
#    \033[1m             - 设置高亮度
#    \033[4m             - 下划线
#    \033[5m             - 闪烁
#    \033[7m             - 反显
#    \033[8m             - 消隐
#    \033[30m - \033[37m - 设置前景色
#    \033[40m - \033[47m - 设置背景色
#    \033[nA             - 光标上移n行
#    \033[nB             - 光标下移n行
#    \033[nC             - 光标右移n行
#    \033[nD             - 光标左移n行
#    \033[y;xH           - 设置光标位置
#    \033[2J             - 清屏
#    \033[K              - 清除从光标到行尾的内容
#    \033[s              - 保存光标位置
#    \033[u              - 恢复光标位置
#    \033[?25l           - 隐藏光标
#    \033[?25h           - 显示光标
echo -e "\033[0m\033[32m执行结束，退出\033[37m"

exit 0
